{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented Framer Motion animations, glassmorphism UI styling, interactive micro-interactions, and enhanced hero section with particle effects across all portfolio components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing CSS animations, glassmorphism effects, scroll-linked animations, 3D tilt effects, and custom hooks for parallax and spotlight interactions.",
  "frontend/index.css": "Global Tailwind CSS configuration with dark mode CSS variables, custom color palette using OKLCH color space, and base styling for background and foreground colors.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google Fonts preconnect, and viewport configuration for the portfolio application.",
  "frontend/src/App.tsx": "Main React application component that forces dark mode, renders AnimatedBackground, ScrollProgress, navigation, all portfolio sections, and ScrollToTop button.",
  "frontend/src/components/About.tsx": "About section component with Intersection Observer for visibility detection, glassmorphism cards displaying product strategy, design systems, and visual storytelling key points, plus bio section with profile image.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based animated grid background with moving vertical and horizontal lines and gradient mesh overlay using requestAnimationFrame.",
  "frontend/src/components/Contact.tsx": "Contact section with glassmorphism cards showing email, location, and availability info alongside a contact form with name, email, and message inputs.",
  "frontend/src/components/Experience.tsx": "Displays professional experience section with timeline, achievements, and scroll-based animations using IntersectionObserver and scroll progress tracking.",
  "frontend/src/components/Footer.tsx": "Renders footer with copyright, attribution to caffeine.ai, and dynamic year display.",
  "frontend/src/components/Hero.tsx": "Hero section with parallax effects, floating UI elements, particle background, and call-to-action buttons for navigation.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll detection, active section tracking, smooth scrolling, and responsive mobile menu.",
  "frontend/src/components/ParticleBackground.tsx": "Renders animated grid background pattern with scrolling animation effect.",
  "frontend/src/components/Projects.tsx": "Projects showcase with 3D tilt effects, spotlight hover interactions, and staggered fade-in animations for project cards.",
  "frontend/src/components/ScrollProgress.tsx": "Fixed top progress bar that visualizes page scroll progress with gradient styling.",
  "frontend/src/components/ScrollToTop.tsx": "Floating button that appears on scroll and smoothly returns user to top of page.",
  "frontend/src/components/Skills.tsx": "Skills section displaying categorized expertise in bento grid layout with icons and intersection-observer-based animations.",
  "frontend/src/hooks/use3DTilt.ts": "Empty file, likely intended for custom 3D tilt effect hook implementation.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages an authenticated or anonymous actor instance using React Query, automatically recreating the actor when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useFramerAnimations.ts": "Empty file placeholder for Framer Motion animation hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and delegation validation throughout the React component tree.",
  "frontend/src/hooks/useMouseParallax.ts": "Empty file placeholder for mouse parallax effect hooks.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty file as the backend has no methods to query; all content is static and rendered client-side.",
  "frontend/src/hooks/useScrollProgress.ts": "Empty file placeholder for scroll progress tracking hooks.",
  "frontend/src/hooks/useSpotlight.ts": "Empty file placeholder for spotlight effect hooks.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for light/dark themes using OKLCH color space, Tailwind directives, Plus Jakarta Sans font import, and utility classes for glassmorphism effects and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH colors, sidebar variants, teal/emerald shades, custom border radii, Plus Jakarta Sans font, and animation keyframes for accordions and carousels.",
  "project_state.json": "Project metadata describing a modern portfolio website for Mukesh Kumar M with Mobbin-style UI, dark theme with teal accents, featuring hero section, timeline experience, project showcases, skills grid, and contact form built with React, Vite, Tailwind, shadcn/ui, and Framer Motion."
}