{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting three design-focused color palette replacement features across frontend components, with high confidence and mapped test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components with design-focused color schemes (figma purple, coral, tangerine), glassmorphism effects, and animation implementations.",
  "frontend/index.css": "Global Tailwind CSS configuration with CSS custom properties for light/dark themes using OKLCH color space, defining design system tokens for colors, borders, and component styling.",
  "frontend/index.html": "HTML entry point with SEO meta tags for Mukesh Kumar M's UI/UX Developer portfolio, Google Fonts preconnect, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component that forces dark mode, renders AnimatedBackground, ScrollProgress, Navbar, all portfolio sections, and ScrollToTop button.",
  "frontend/src/components/About.tsx": "About section component with Intersection Observer visibility detection, profile image with gradient overlay, bio text, and four key points cards featuring icons and descriptions with staggered animations.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based animated background rendering design elements (artboards, bounding boxes, grid, alignment guides) with subtle purple/orange gradients that float vertically across the viewport.",
  "frontend/src/components/Contact.tsx": "Contact section with Intersection Observer animations, three info cards (email, location, availability) with icons, and a form with name, email, and message inputs using glassmorphism styling.",
  "frontend/src/components/Experience.tsx": "Displays work experience section with animated timeline, job cards showing roles, achievements, and scroll-triggered visibility effects using IntersectionObserver.",
  "frontend/src/components/Footer.tsx": "Renders footer with copyright notice, attribution link to caffeine.ai, and animated heart icon.",
  "frontend/src/components/Hero.tsx": "Hero section with parallax background, floating UI elements, gradient orbs, and CTA buttons that scroll to other sections.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll detection, active section highlighting, smooth scrolling, and responsive mobile menu.",
  "frontend/src/components/ParticleBackground.tsx": "Renders animated grid background overlay with scrolling animation effect.",
  "frontend/src/components/Projects.tsx": "Project showcase with 3D tilt effects, spotlight hover interactions, gradient backgrounds, and animated project cards.",
  "frontend/src/components/ScrollProgress.tsx": "Fixed top progress bar that fills horizontally based on page scroll position.",
  "frontend/src/components/ScrollToTop.tsx": "Floating button that appears after scrolling down 300px and smoothly scrolls back to top when clicked.",
  "frontend/src/components/Skills.tsx": "Skills section displaying categorized expertise in bento grid layout with icons, animated cards, and scroll-triggered visibility.",
  "frontend/src/hooks/use3DTilt.ts": "Empty file, likely intended for custom 3D tilt effect hook logic.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication, using React Query to cache actors per identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useFramerAnimations.ts": "Empty file placeholder for Framer Motion animation hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMouseParallax.ts": "Empty file placeholder for mouse parallax effect hooks.",
  "frontend/src/hooks/useQueries.ts": "Empty file noting that backend has no query methods; all content is static and client-side rendered.",
  "frontend/src/hooks/useScrollProgress.ts": "Empty file placeholder for scroll progress tracking hooks.",
  "frontend/src/hooks/useSpotlight.ts": "Empty file placeholder for spotlight effect hooks.",
  "frontend/src/index.css": "Global styles with Tailwind CSS setup, Plus Jakarta Sans font import, OKLCH color system with dark mode support, and custom utility classes for glassmorphism effects and animated gradients.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration with OKLCH color system, custom theme extensions for sidebar/chart colors, figma/coral/tangerine palette, typography and container-queries plugins, and custom font/shadow definitions.",
  "project_state.json": "Project metadata describing a portfolio website for Mukesh Kumar M with Mobbin-style UI, featuring hero section, experience timeline, project showcases, skills grid, and contact form built with React, Vite, Tailwind, shadcn/ui, and Framer Motion."
}