{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the ICP application.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of 'mukesh@example.com' with 'mukeshhkumarr16@gmail.com' in the Contact component with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend component files describing their functionality, styling, and design system implementation with figma/coral/tangerine color palette.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system variables for light and dark modes, including sidebar, chart, and UI component color definitions.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Google Fonts preconnect, and viewport configuration for Mukesh Kumar M's portfolio.",
  "frontend/src/App.tsx": "Main React application component that forces dark mode and renders all portfolio sections with AnimatedBackground, ScrollProgress, Navbar, and ScrollToTop components.",
  "frontend/src/components/About.tsx": "About section component with intersection observer animation, profile image with gradient glow, bio text, and four key points cards featuring icons and descriptions.",
  "frontend/src/components/AnimatedBackground.tsx": "Canvas-based animated background rendering a grid pattern and rotating artboard elements with gradient fills using figma purple, coral pink, and tangerine orange colors.",
  "frontend/src/components/Contact.tsx": "Contact section with glassmorphism cards displaying contact info (email: mukeshhkumarr16@gmail.com, location, availability) and a contact form with name, email, and message fields.",
  "frontend/src/components/Experience.tsx": "Displays work experience section with animated timeline, company cards showing roles, achievements, and scroll-based progress indicators using IntersectionObserver.",
  "frontend/src/components/Footer.tsx": "Renders footer with copyright notice and attribution link to caffeine.ai with dynamic year and hostname-based UTM parameters.",
  "frontend/src/components/Hero.tsx": "Hero section with animated gradient text, parallax floating UI elements, particle background, and CTA buttons that scroll to About and Contact sections.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll-based styling, active section tracking, smooth scrolling to sections, and responsive mobile menu toggle.",
  "frontend/src/components/ParticleBackground.tsx": "Renders an animated grid background overlay with scrolling animation using a design-grid image.",
  "frontend/src/components/Projects.tsx": "Projects showcase with 3D tilt effect cards, spotlight hover interactions, gradient backgrounds, and animated badges for project tags.",
  "frontend/src/components/ScrollProgress.tsx": "Fixed top progress bar that fills horizontally based on page scroll position using gradient colors.",
  "frontend/src/components/ScrollToTop.tsx": "Floating button that appears after scrolling 300px down and smoothly scrolls back to page top when clicked.",
  "frontend/src/components/Skills.tsx": "Skills section displaying categorized expertise in a bento grid layout with animated cards, icons, and staggered fade-in effects.",
  "frontend/src/hooks/use3DTilt.ts": "Empty file, likely intended for a custom hook to handle 3D tilt effects (currently unused).",
  "frontend/src/hooks/useActor.ts": "React hook that manages ICP actor creation with Internet Identity authentication, automatically creating anonymous or authenticated actors based on identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useFramerAnimations.ts": "Empty file placeholder for Framer Motion animation hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMouseParallax.ts": "Empty file placeholder for mouse parallax effect hooks.",
  "frontend/src/hooks/useQueries.ts": "Empty file with comment indicating no backend query methods exist; all content is static and client-side rendered.",
  "frontend/src/hooks/useScrollProgress.ts": "Empty file placeholder for scroll progress tracking hooks.",
  "frontend/src/hooks/useSpotlight.ts": "Empty file placeholder for spotlight effect hooks.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom OKLCH color palette for light/dark modes featuring enhanced figma purple, coral, and tangerine colors with improved chroma and contrast ratios, and Plus Jakarta Sans font configuration.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with OKLCH-based color system including figma purple, coral, and tangerine palettes, custom animations, typography plugin, and container queries support.",
  "project_state.json": "Project metadata describing a modern portfolio website for Mukesh Kumar M with Mobbin-style UI/UX, featuring hero section, timeline experience, project showcases, bento-grid skills, and contact form built with React, Vite, Tailwind, shadcn/ui, and Framer Motion."
}